# YOLOv3 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [10,14, 23,27, 37,58]  # P4/16
  - [81,82, 135,169, 344,319]  # P5/32

# YOLOv3-tiny backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, DSQuantConv2d_BNFoldVP, [16, 3, 0, 1, 0, 1, 1, False, 1e-6, 0.01, True]],  # 0
   [-1, 1, nn.ReLU, inplace=True],
   [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 1-P1/2
   [-1, 1, DSQuantConv2d_BNFoldVP, [32, 3, 0, 1, 0]],
   [-1, 1, nn.ReLU, inplace=True],
   [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 3-P2/4
   [-1, 1, DSQuantConv2d_BNFoldVP, [64, 3, 0, 1, 0]],
   [-1, 1, nn.ReLU, inplace=True],
   [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 5-P3/8
   [-1, 1, DSQuantConv2d_BNFoldVP, [128, 3, 0, 1, 0]],
   [-1, 1, nn.ReLU, inplace=True],
   [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 7-P4/16
   [-1, 1, DSQuantConv2d_BNFoldVP, [256, 3, 0, 1, 0]], # 8
   [-1, 1, nn.ReLU, inplace=True],
   [-1, 1, nn.MaxPool2d, [2, 2, 0]],  # 9-P5/32
   [-1, 1, DSQuantConv2d_BNFoldVP, [512, 3, 0, 1, 0]],
   [-1, 1, nn.ReLU, inplace=True],
   [-1, 1, nn.ZeroPad2d, [[0, 1, 0, 1]]],  # 11
   [-1, 1, nn.MaxPool2d, [2, 1, 0]],  # 12
  ]

# YOLOv3-tiny head
head:
  [[-1, 1, DSQuantConv2d_BNFoldVP, [1024, 3, 0, 1, 0]],
   [-1, 1, nn.ReLU, inplace=True],
   [-1, 1, DSQuantConv2d_BNFoldVP, [256, 1, 0, 1, 0]],
   [-1, 1, nn.ReLU, inplace=True],
   [-1, 1, DSQuantConv2d_BNFoldVP, [512, 3, 0, 1, 0]],  # 15 (P5/32-large)
   [-1, 1, nn.ReLU, inplace=True],

   [-3, 1, DSQuantConv2d_BNFoldVP, [128, 1, 0, 1, 0]],
   [-1, 1, nn.ReLU, inplace=True],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 13], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, DSQuantConv2d_BNFoldVP, [256, 3, 0, 1, 0]],  # 19 (P4/16-medium)
   [-1, 1, nn.ReLU, inplace=True],

   [[30, 24], 1, Detect, [nc, anchors]],  # Detect(P4, P5)
  ]